

Функция ПолучитьЦентральныйУзелОбмена() Экспорт

	ЦентральныйУзелОбмена = ПланыОбмена.ОбменССервером.НайтиПоКоду("001");

	Если ЦентральныйУзелОбмена.Пустая() Тогда

		НовыйУзел = ПланыОбмена.ОбменССервером.СоздатьУзел();
		НовыйУзел.Код          = "001";
		НовыйУзел.Наименование = НСтр("ru = 'Центральный'; en = 'General'");
		НовыйУзел.Записать();

		ЦентральныйУзелОбмена = НовыйУзел.Ссылка;

	КонецЕсли;

	Возврат ЦентральныйУзелОбмена;

КонецФункции

Функция ПолучитьБригаду(НомерБригады) Экспорт
	
	Возврат Справочники.Бригады.НайтиПоКоду(НомерБригады); 
	
КонецФункции