


Процедура УдалитьРегистрациюИзмененийОтправленныхДанных() Экспорт

	ЦентральныйУзелОбмена = ОбменВызовСервераПовтИсп.ПолучитьЦентральныйУзелОбмена();

	// После записи сообщения в очередь регистрация изменений очищается
	ПланыОбмена.УдалитьРегистрациюИзменений(ЦентральныйУзелОбмена);

	ЦентральныйУзелОбменаОбъект = ЦентральныйУзелОбмена.ПолучитьОбъект();
	ЦентральныйУзелОбменаОбъект.НомерОтправленного = ЦентральныйУзелОбменаОбъект.НомерОтправленного + 1;
	ЦентральныйУзелОбменаОбъект.Записать();

КонецПроцедуры


