
#Область ПрограммныйИнтерфейс

// Выводит сообщение с временем когда была последняя синхронизация данных.
//
// Параметры:
//  Элементы					 - ЭлементыФормы - Элементы текущей формы.
//  ОписаниеПоследнегоОбновления - Строка - Описание срока последней синхронизации.
//
Процедура УстановитьПодписьКДатеОбновления(Элементы, ОписаниеПоследнегоОбновления) Экспорт

	ДанныеДляПодписи = ПолучитьПодписьКДатеОбновленияИНаличиеДанныхДляОтправки();
	ОписаниеПоследнегоОбновления = ДанныеДляПодписи.ОписаниеПоследнегоОбновления;

	Если ДанныеДляПодписи.ЕстьНеотправленныеДанные Тогда
		НужнаяСтраница = Элементы.Внимание;
	Иначе
		НужнаяСтраница = Элементы.Обычная;
	КонецЕсли;

	// Отобразим нужную страницу формы, если это необходимо
	Если Не Элементы.ГруппаКнопкаОбновить.ТекущаяСтраница = НужнаяСтраница Тогда
		Элементы.ГруппаКнопкаОбновить.ТекущаяСтраница = НужнаяСтраница;
	КонецЕсли;

КонецПроцедуры

Процедура НачатьСинхронизацию(ФормаИсточник) Экспорт
	
	// Выполняем проверку, выполнялась синхронизация хотя бы один раз или нет
	ДатаПоследнегоОбновления = ОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("ДатаПоследнегоОбновления");

	Если ЗначениеЗаполнено(ДатаПоследнегоОбновления) Тогда
		ФормаИсточник.ОтключитьОбработчикОжидания("ОбработчикОжиданияУстановитьПодписьКДатеОбновления");
		ФормаИсточник.Элементы.ГруппаКнопкаОбновить.ТекущаяСтраница = ФормаИсточник.Элементы.ВПроцессе;
		ФормаИсточник.ПодключитьОбработчикОжидания("ВыполнитьСинхронизациюНачало", 0.1, Истина);
		Если ОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("ЕстьНеотправленныеФото") Тогда
			ФормаИсточник.ПодключитьОбработчикОжидания("ОтправитьФото", 0.5, Истина);	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ЗавершитьСинхронизацию(
	ФормаИсточник, СведенияОЗагруженныхДанных = Неопределено) Экспорт

	Оповестить("СинхронизацияЗавершена", СведенияОЗагруженныхДанных);

	ФормаИсточник.ПодключитьОбработчикОжидания(
		"ОбработчикОжиданияУстановитьПодписьКДатеОбновления", 60, Ложь);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПодписьКДатеОбновленияИНаличиеДанныхДляОтправки()

	ТекущаяДата = ТекущаяДата();
	ДатаПоследнегоОбновления = Дата(1,1,1);
	ЕстьДанныеДляОтправки = Ложь;

	ОбщегоНазначенияВызовСервера.ПолучитьДатуПоследнегоОбновленияИНаличиеДанныхДляОтправки(
		ДатаПоследнегоОбновления, ЕстьДанныеДляОтправки);

	Если Не ЗначениеЗаполнено(ДатаПоследнегоОбновления) Тогда

		ОписаниеПоследнегоОбновления = 
			НСтр("ru = 'Не настроено подключение'; en = 'Check connection settings'");

		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ОписаниеПоследнегоОбновления", ОписаниеПоследнегоОбновления);
		СтруктураВозврата.Вставить("ЕстьНеотправленныеДанные"    , Ложь);

	Иначе

		Период = (ТекущаяДата - ДатаПоследнегоОбновления)/60;
		ОписаниеПоследнегоОбновления = 
			ПолучитьОписаниеПоследнегоОбновления(Период, ТекущаяДата, ДатаПоследнегоОбновления);

		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("ОписаниеПоследнегоОбновления", ОписаниеПоследнегоОбновления);
		СтруктураВозврата.Вставить("ЕстьНеотправленныеДанные"    , ЕстьДанныеДляОтправки);

	КонецЕсли;

	Возврат СтруктураВозврата;

КонецФункции

Функция ПолучитьОписаниеПоследнегоОбновления(Период, ТекущаяДата, ДатаПоследнегоОбновления)

	ОписаниеПоследнегоОбновления = "";

	Если Период < 1 Тогда
		ОписаниеПоследнегоОбновления = 
			НСтр("ru = 'Обновлено только что'; en = 'Updated just now'");

	ИначеЕсли Период < 2 Тогда
		ОписаниеПоследнегоОбновления = 
			НСтр("ru = 'Обновлено минуту назад'; en = 'Updated a minute ago'");

	ИначеЕсли Период < 3 Тогда
		ОписаниеПоследнегоОбновления = 
			НСтр("ru = 'Обновлено 2 минуты назад'; en = 'Updated 2 minutes ago'");

	ИначеЕсли Период < 4 Тогда
		ОписаниеПоследнегоОбновления = 
			НСтр("ru = 'Обновлено 3 минуты назад'; en = 'Updated 3 minutes ago'");

	ИначеЕсли Период < 5 Тогда
		ОписаниеПоследнегоОбновления = 
			НСтр("ru = 'Обновлено 4 минуты назад'; en = 'Updated 4 minutes ago'");

	ИначеЕсли Период < 6 Тогда
		ОписаниеПоследнегоОбновления = 
			НСтр("ru = 'Обновлено 5 минуты назад'; en = 'Updated 5 minutes ago'");

	ИначеЕсли Период < 15 Тогда
		ОписаниеПоследнегоОбновления = 
			НСтр("ru = 'Обновлено 15 минут назад'; en = 'Updated 15 minutes ago'");

	ИначеЕсли Период < 30 Тогда
		ОписаниеПоследнегоОбновления = 
			НСтр("ru = 'Обновлено 30 минут назад'; en = 'Updated 30 minutes ago'");

	ИначеЕсли Период < 60 Тогда
		ОписаниеПоследнегоОбновления = 
			НСтр("ru = 'Обновлено менее часа назад'
			   |; en = 'Updated less than an hour ago'");

	ИначеЕсли Период < 120 Тогда
		ОписаниеПоследнегоОбновления = 
			НСтр("ru = 'Обновлено менее 2 часов назад'
			   |; en = 'Updated less than an 2 hours ago'");

	ИначеЕсли ДатаПоследнегоОбновления < КонецДня(ТекущаяДата) 
		И ДатаПоследнегоОбновления > НачалоДня(ТекущаяДата) Тогда
		ОписаниеПоследнегоОбновления = 
			СтрШаблон(
				НСтр("ru = 'Обновлено сегодня в %1'; en = 'Updated today at %1'"),
				Формат(ДатаПоследнегоОбновления, "ДФ='HH:mm'"));

	ИначеЕсли ДатаПоследнегоОбновления < НачалоДня(ТекущаяДата)
		И ДатаПоследнегоОбновления > НачалоДня(ТекущаяДата - 24*60*60) Тогда
		ОписаниеПоследнегоОбновления = 
			СтрШаблон(
				НСтр("ru = 'Обновлено вчера в %1'; en = 'Updated yesterday at %1'"),
				Формат(ДатаПоследнегоОбновления, "ДФ='HH:mm'"));

	Иначе
		ОписаниеПоследнегоОбновления = 
			СтрШаблон(
				НСтр("ru = 'Обновлено %1'; en = 'Updated %1'"),
				Формат(ДатаПоследнегоОбновления, "ДФ='dd.MM.yyyy HH:mm'"));
	КонецЕсли;

	Возврат ОписаниеПоследнегоОбновления;

КонецФункции 

#КонецОбласти