
Процедура ДобавитьТекущегоПользователя() Экспорт
	
	Пользователь = Константы.ПользовательЦентральнойБазы.Получить();
	
	ЛокальныйПользователь = Справочники.Пользователи.НайтиПоНаименованию(Пользователь, Истина);
	Если ЛокальныйПользователь.Пустая() Тогда 
		ЛокальныйПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
	Иначе
		ЛокальныйПользовательОбъект = ЛокальныйПользователь.ПолучитьОбъект();	
	КонецЕсли;
	
	ХэшированиеДанных = Новый ХешированиеДанных(ХешФункция.CRC32);
	ХэшированиеДанных.Добавить(Константы.Пароль.Получить());

	ЛокальныйПользовательОбъект.Наименование = Пользователь; 
	ЛокальныйПользовательОбъект.ХешПароля = ХэшированиеДанных.ХешСумма;
	ЛокальныйПользовательОбъект.Записать();	
		
КонецПроцедуры