
Перем глВКRSDriver Экспорт;
Перем глВКRSExchange Экспорт;

Процедура ПриНачалеРаботыСистемы()
	
	ОбщегоНазначенияКлиент.ИнициализироватьВнешнююКомпонентуRSDriver();
	//ОбщегоНазначенияКлиент.ИнициализироватьВнешнююКомпонентуRSExchange();
	
	ОткрытьФорму("ОбщаяФорма.Авторизация");
	
КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы()

	Попытка
		глВКRSDriver.Отключить();
		глВКRSDriver.ЗакончитьОжиданиеПриемаДанных();
	Исключение
	КонецПопытки;
		
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	// Подготовить данные
	ОписаниеСобытия = Новый Структура();
	ОписаниеСобытия.Вставить("Источник", Источник);
	ОписаниеСобытия.Вставить("Событие",  Событие);
	ОписаниеСобытия.Вставить("Данные",   Данные);
	
	// Передать на обработку данные.
	ОбщегоНазначенияКлиент.ОбработатьСобытиеОтУстройства(ОписаниеСобытия);


	
КонецПроцедуры

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	ОбщегоНазначенияВызовСервера.УстановитьПервоначальныеНастройки();
	
КонецПроцедуры
