
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПрочитатьКонстанты();
	
КонецПроцедуры



&НаСервере
Процедура ПрочитатьКонстанты()
	
	Набор = Константы.СоздатьНабор();
	Набор.Прочитать();
	ЗначениеВРеквизитФормы(Набор, "НаборКонстант");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКонстанты()
	
	УстановитьПривилегированныйРежим(Истина);
	Набор = РеквизитФормыВЗначение("НаборКонстант");
	Набор.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФото(Команда)

	ОбщегоНазначенияВызовСервера.УдалитьСтарыеФото();

КонецПроцедуры


&НаКлиенте
Процедура НаборКонстантЗвукПриСканированииПриИзменении(Элемент)
	
 	ЗаписатьКонстанты();
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантКоличествоДнейХраненияФотоПриИзменении(Элемент)
	
	ЗаписатьКонстанты();
	
КонецПроцедуры

&НаКлиенте
Процедура НаборКонстантВиброПриСканированииПриИзменении(Элемент)
	
 	ЗаписатьКонстанты();
	
КонецПроцедуры
